js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   /* Enable MDMA AHB6 clock.  Idempotent. */
   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   /* Drain any prior QSPI state. */
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;

   /* Disable channel and clear any pending flags. */
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   /* Clean+invalidate the destination cache range when requested so:
    *  (a) any dirty lines won't get written back over MDMA data, and
    *  (b) a subsequent CPU read picks up the fresh DDR contents.
    * The Cortex-A7 minimum L1 D-line is 32 B; loop is conservative. */
   const uint32_t line_sz = 32U;
   if (clean_before) {
      for (uint32_t a = dst_addr & ~(line_sz - 1U);
           a < dst_addr + len; a += line_sz)
         L1C_CleanInvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");
   }

   /* Number of bytes per buffer transfer. Choose 64 B = 16 beats of
    * 32-bit (matches AXI/AHB max burst length on this CPU bus).  TLEN
    * field is "bytes-1". */
   const uint32_t tlen = 64U;
   const uint32_t bndt = len; /* block size in bytes */

   /* CTCR:
    *   SINC = 0  (source address fixed, QUADSPI->DR)
    *   DINC = 2  (destination increments)
    *   SSIZE = 2 (32-bit reads from FIFO)
    *   DSIZE = 2 (32-bit writes to DDR)
    *   DINCOS = 2 (destination advances by 32-bit words)
    *   SBURST = 0 (single 32-bit read; QSPI FIFO is FTHRES=3 -> >=4 B)
    *   DBURST = 4 (16-beat burst write to DDR)
    *   TLEN  = tlen-1
    *   PKE = 0, PAM = 0 (matched sizes)
    *   TRGM = 0 (each request triggers ONE buffer transfer == TLEN bytes)
    *   SWRM = 0 (HW request)
    *   BWM  = 1 (bufferable writes -- DDR is normal cacheable)
    */
   const uint32_t ctcr =
       (0U  << MDMA_CTCR_SINC_Pos)   |
       (2U  << MDMA_CTCR_DINC_Pos)   |
       (2U  << MDMA_CTCR_SSIZE_Pos)  |
       (2U  << MDMA_CTCR_DSIZE_Pos)  |
       (2U  << MDMA_CTCR_DINCOS_Pos) |
       (0U  << MDMA_CTCR_SBURST_Pos) |
       (4U  << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
       MDMA_CTCR_BWM;

   /* CBNDTR.BNDT = block size in bytes (max 0x1FFFF = 128 KB - 1).
    * For multi-MB transfers, use block-repeat with 65536-byte blocks.
    * Decimal tails are handled by the caller as separate <=128 KB chunks. */
   if (len > 0x1FFFFU) {
      if (len & 0xFFFFU)
         return HAL_ERROR;
      const uint32_t blocks = len >> 16; /* len / 65536 */
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos) |
                   MDMA_CBNDTR_BRDUM; /* dst increments across blocks */
      /* No source/destination block address offset (contiguous). */
      ch->CBRUR = 0U;
   } else {
      ch->CBNDTR = bndt & MDMA_CBNDTR_BNDT_Msk;
      ch->CBRUR  = 0U;
   }

   ch->CTCR = ctcr;
   ch->CSAR = (uint32_t)&QUADSPI->DR;
   ch->CDAR = dst_addr;
   /* CTBR.TSEL = 0x1A (QUADSPI FIFO threshold).  SBUS/DBUS = 0 (AXI). */
   ch->CTBR = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

   /* Build QUADSPI CCR (FMODE=01 indirect read).  Match the bench's
    * raw / non-raw layout. */
   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   if (!raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   /* Assert DMAEN before kicking the read. */
   QUADSPI->CR |= QUADSPI_CR_DMAEN;

   /* Enable MDMA channel BEFORE the QSPI request can fire. */
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;

   QUADSPI->CCR = ccr;
   if (!raw)
      QUADSPI->AR = 0U;

   mdma_active_dst = dst_addr;
   mdma_active_len = len;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_crc_start(uint8_t opcode,
                                      qspi_lines_t data_lines,
                                      uint8_t dummy_cycles,
                                      uint32_t len,
                                      bool raw,
                                      uint32_t crc_dr_addr,
                                      uint32_t timeout_ms)
{
   if (!initialised || len == 0U)
      return HAL_ERROR;
   if (mdma_active)
      return HAL_BUSY;

   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   const uint32_t tlen = 64U;
   ch->CTCR =
       (0U << MDMA_CTCR_SINC_Pos) |
       (0U << MDMA_CTCR_DINC_Pos) |
       (0U << MDMA_CTCR_SSIZE_Pos) |
       (0U << MDMA_CTCR_DSIZE_Pos) |
       (0U << MDMA_CTCR_SINCOS_Pos) |
       (0U << MDMA_CTCR_DINCOS_Pos) |
       (0U << MDMA_CTCR_SBURST_Pos) |
       (0U << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos);

   if (len > 0x1FFFFU) {
      if (len & 0xFFFFU)
         return HAL_ERROR;
      const uint32_t blocks = len >> 16;
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos);
   } else {
      ch->CBNDTR = len & MDMA_CBNDTR_BNDT_Msk;
   }
   ch->CBRUR = 0U;
   ch->CSAR = (uint32_t)&QUADSPI->DR;
   ch->CDAR = crc_dr_addr;
   ch->CTBR = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

