js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   if (!raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   QUADSPI->CR |= QUADSPI_CR_DMAEN;
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;

   QUADSPI->CCR = ccr;
   if (!raw)
      QUADSPI->AR = 0U;

   mdma_active_dst = 0U;
   mdma_active_len = 0U;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_crc_read(uint8_t opcode,
                                     qspi_lines_t data_lines,
                                     uint8_t dummy_cycles,
                                     uint32_t len,
                                     bool raw,
                                     uint32_t crc_dr_addr,
                                     uint32_t timeout_ms)
{
   HAL_StatusTypeDef s = qspi_mdma_crc_start(opcode, data_lines,
                                             dummy_cycles, len, raw,
                                             crc_dr_addr, timeout_ms);
   if (s != HAL_OK)
      return s;
   return qspi_mdma_finish_no_inval(timeout_ms);
}

HAL_StatusTypeDef qspi_mdma_finish_no_inval(uint32_t timeout_ms)
{
   if (!mdma_active)
      return HAL_ERROR;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   /* Poll for MDMA CTC (channel transfer complete) AND QSPI TCF. */
   for (;;) {
      const uint32_t cisr = ch->CISR;
      if (cisr & MDMA_CISR_TEIF) {
         my_printf("MDMADBG TE cesr=%08lx\r\n",
                   (unsigned long)ch->CESR);
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_ERROR;
      }
      if (cisr & MDMA_CISR_CTCIF)
         break;
      if (QUADSPI->SR & QUADSPI_SR_TEF) {
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         my_printf("MDMADBG timeout cisr=%08lx sr=%08lx bndt=%08lx\r\n",
                   (unsigned long)cisr, (unsigned long)QUADSPI->SR,
                   (unsigned long)ch->CBNDTR);
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_TIMEOUT;
      }
   }

   /* Wait for QSPI transfer-complete flag too. */
   while (!(QUADSPI->SR & QUADSPI_SR_TCF)) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTCF;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_TIMEOUT;
      }
   }

   /* Tear down. */
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;
   ch->CCR = 0U;
   QUADSPI->CR &= ~QUADSPI_CR_DMAEN;

   mdma_active = false;
   return HAL_OK;
}

void qspi_invalidate_range(uint32_t addr, uint32_t len)
{
   const uint32_t line_sz = 32U;
   for (uint32_t a = addr & ~(line_sz - 1U); a < addr + len; a += line_sz)
      L1C_InvalidateDCacheMVA((void *)a);
   __asm volatile("dsb sy" ::: "memory");
}

HAL_StatusTypeDef qspi_mdma_finish(uint32_t timeout_ms)
{
   const uint32_t dst = mdma_active_dst;
   const uint32_t len = mdma_active_len;
   HAL_StatusTypeDef s = qspi_mdma_finish_no_inval(timeout_ms);
   if (s == HAL_OK)
      qspi_invalidate_range(dst, len);
   return s;
}

HAL_StatusTypeDef qspi_mdma_read(uint8_t opcode, qspi_lines_t data_lines,
                                 uint8_t dummy_cycles, uint32_t len,
                                 bool raw, uint32_t dst_addr,
                                 uint32_t timeout_ms, bool clean_before)
{
   HAL_StatusTypeDef s = qspi_mdma_start(opcode, data_lines, dummy_cycles,
                                         len, raw, dst_addr, timeout_ms,
                                         clean_before);
   if (s != HAL_OK)
      return s;
   return qspi_mdma_finish(timeout_ms);
}
